Autodesk.Revit.DB.GeometryElement.GetBoundingBox
Retrieves a box that encloses the geometry element.
Returns: The bounding box.
Remarks:
Note: If the GeometryElement was obtained via Element.get_Geometry from an Element containing 2D geometry
but no 3D geometry, the bounding box returned by this function may not be empty because it takes the 2D geometry into account.
Since:  2013